Revit 2026 API

# FilteredWorksetCollectorToWorksets Method

---

Returns the complete set of worksets that pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Workset> ToWorksets()
```
```vb
Public Function ToWorksets As IList(Of Workset)
```
```cpp
public:
IList<Workset^>^ ToWorksets()
```
```fsharp
member ToWorksets : unit -> IList<Workset>
```

#### Return Value

IListWorkset The complete array of worksets.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter. |

This will reset the collector to the beginning and extract all worksets that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace